#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.conquer-vpc: Reading...
aws_internet_gateway.igw: Refreshing state... [id=igw-0cae512eb1e53a1b2]
data.aws_iam_policy_document.assume_eks_role: Reading...
aws_eip.vpc_eip["eu-north-1a"]: Refreshing state... [id=eipalloc-0db04dfe8dac8e26a]
aws_eip.vpc_eip["eu-north-1b"]: Refreshing state... [id=eipalloc-0517e61fb3eb492bf]
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
aws_eip.vpc_eip["eu-north-1c"]: Refreshing state... [id=eipalloc-0fb5089af05d5575b]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
aws_iam_role.eks_role: Refreshing state... [id=dev-conquer-eks-role]
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
aws_iam_role.eks_worker_role: Refreshing state... [id=dev-conquer-eks-worker-role]
data.aws_caller_identity.current: Read complete after 1s [id=014630368052]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-conquer-eks-worker-role-20231102081445313400000004]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-conquer-eks-worker-role-20231102081445324000000005]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-conquer-eks-worker-role-20231102081445038700000002]
aws_iam_role_policy_attachment.AmazonEC2RoleforSSM: Refreshing state... [id=dev-conquer-eks-worker-role-20231102081445150500000003]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-conquer-eks-role-20231102081444978400000001]
data.aws_vpc.conquer-vpc: Read complete after 2s [id=vpc-080a377054fdb71a7]
aws_subnet.eks_subnets_public["eu-north-1a"]: Refreshing state... [id=subnet-0e5ff639c09637fec]
aws_subnet.eks_subnets_public["eu-north-1c"]: Refreshing state... [id=subnet-04be1cbf74a5d7b53]
aws_subnet.eks_subnets_public["eu-north-1b"]: Refreshing state... [id=subnet-02458b18d20e64552]
aws_subnet.eks_subnets_private["eu-north-1c"]: Refreshing state... [id=subnet-052fae2c369541923]
aws_route_table.private_subnet_rt["eu-north-1c"]: Refreshing state... [id=rtb-09f228b985104d9e4]
aws_route_table.private_subnet_rt["eu-north-1b"]: Refreshing state... [id=rtb-056165dcb82c1500f]
aws_subnet.eks_subnets_private["eu-north-1a"]: Refreshing state... [id=subnet-0fe97f38f7b6fafd2]
aws_route_table.private_subnet_rt["eu-north-1a"]: Refreshing state... [id=rtb-02d414f0998dbc2fb]
aws_subnet.eks_subnets_private["eu-north-1b"]: Refreshing state... [id=subnet-0efbca871ba7a90e9]
aws_nat_gateway.nat_gw["eu-north-1a"]: Refreshing state... [id=nat-05ae3e10c3f2a7894]
aws_nat_gateway.nat_gw["eu-north-1c"]: Refreshing state... [id=nat-0ce1a1dc4d7ae04d9]
aws_nat_gateway.nat_gw["eu-north-1b"]: Refreshing state... [id=nat-013894ebdf0f60275]
aws_eks_cluster.eks: Refreshing state... [id=dev-conquer-cluster]
aws_route_table_association.private_subnet_rt_association["eu-north-1b"]: Refreshing state... [id=rtbassoc-0a1634e267745e3a7]
aws_route_table_association.private_subnet_rt_association["eu-north-1c"]: Refreshing state... [id=rtbassoc-05a3f22eafde2fa11]
aws_route_table_association.private_subnet_rt_association["eu-north-1a"]: Refreshing state... [id=rtbassoc-0a9de4583f25e6909]
aws_route.nat_access["eu-north-1c"]: Refreshing state... [id=r-rtb-09f228b985104d9e41080289494]
aws_route.nat_access["eu-north-1a"]: Refreshing state... [id=r-rtb-02d414f0998dbc2fb1080289494]
aws_route.nat_access["eu-north-1b"]: Refreshing state... [id=r-rtb-056165dcb82c1500f1080289494]
aws_eks_addon.example: Refreshing state... [id=dev-conquer-cluster:vpc-cni]
aws_eks_node_group.node-group["eu-north-1b"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-1]
aws_eks_node_group.node-group["eu-north-1c"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-2]
aws_eks_node_group.node-group["eu-north-1a"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_eip.vpc_eip["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_eip" "vpc_eip" {
      - allocation_id        = "eipalloc-0fb5089af05d5575b" -> null
      - association_id       = "eipassoc-05ac22c23992399f3" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0fb5089af05d5575b" -> null
      - network_border_group = "eu-north-1" -> null
      - network_interface    = "eni-0ccbe58b9415c5988" -> null
      - private_dns          = "ip-10-0-6-165.eu-north-1.compute.internal" -> null
      - private_ip           = "10.0.6.165" -> null
      - public_dns           = "ec2-13-50-182-227.eu-north-1.compute.amazonaws.com" -> null
      - public_ip            = "13.50.182.227" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "dev-conquer-eip-eu-north-1c"
        } -> null
      - tags_all             = {
          - "Name"    = "dev-conquer-eip-eu-north-1c"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc                  = true -> null
    }

  # aws_eks_addon.aws-ebs-csi-driver will be created
  + resource "aws_eks_addon" "aws-ebs-csi-driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + service_account_role_arn    = (known after apply)
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_eks_cluster.eks must be replaced
-/+ resource "aws_eks_cluster" "eks" {
      ~ arn                       = "arn:aws:eks:eu-north-1:014630368052:cluster/dev-conquer-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJSUt3Z1JaaGZVaWt3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpFeE1ESXdPREUwTURsYUZ3MHpNekV3TXpBd09ERTVNRGxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURJUDFtQVJLRTU1NC9SQ2o0eW1ma0tRaTNXZGNGaGJrK0xTb3poU3FaUXhaSXlENzhQVDRQU0d1L3QKVXNGYkF2T3dKNmVxL1NySG5UT09wRUdReUdIWkhCQmkrVlZmeTZndjNENC8xWTVtOWdMZTRpT3pldHE3SnYvaQpITlZJZDJPME83UG1SNGliMDJubmloRE53dHlnbVU3cU1wNjJBUE1XanZBU3VkK1kxdUl3YnhvWUx5K05ZL09wCnhDVjhGUnBUZS8ycklEVkZOdVlkeGg1RWczVTYzUG1aSkxqZTBsN2x0RWhTcm1Dck45S1BCdld2SHJ6TEpLSEsKNHAvdEVIWDZUQ0RMcXZiWUNjY3c2NDFEbi9LdzFuVjZBTWpmNE40aENFSDdsOHMycTluVi9FYTIyTUhGbHNaVAozeWdLNURUb0Z5dmZTV21MNit4alNORy9zaUpoQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTUTdVek9UVkY1a3Via29XWUdSSW5JbG5ZR2pqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQllXb1RQY3JLTwo5aVJKUUdvbS84dk5UMkZHZjdlL2U2Sm9yVXNUa01tb1hrQXFFaFc3Mm9vSVRQeHRZeTNSZXRydUZrRVBabGxUClNjb3NuS1NXZ1ovQXZVV0VyMEp0TFExNy9uQlpuTFJJc2t4ZkJWM28vQlJ0dmR1UGdqU29YS3VFeEowS0lKOXAKTHY5RWw5cUcwTGhybTFZVzVmbHhubzRNeDBwSVNyY25ieml4R3pSNk9rSnlQSS9kZWFBem9BU01icElsSXZNWgovQVVXTHFpZEMwNTcvbDFsOG5pQkdZaVh4aDRLZ09LanNvaFJGT2ZGN0UvRmtmNlNGUll3MEppVjRZeUJwYmtYCjh1bTdHUldzTjZaa2tMZStLS1g3aVJVOEk3cktXVDBOUGswZHk0YjhlaUI3RXcvVzJ4ZjdOTzlmZVQ2THh6ejAKRnhGS2RaYURCQVlJCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2023-11-02 08:14:47.19 +0000 UTC" -> (known after apply)
      ~ endpoint                  = "https://4D5C911EA4AAC0B003DA9BED7AED4EA6.gr7.eu-north-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "dev-conquer-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.eu-north-1.amazonaws.com/id/4D5C911EA4AAC0B003DA9BED7AED4EA6"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "dev-conquer-cluster"
      ~ platform_version          = "eks.3" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "ctf" = "WW91IGdvdCBpdCEgbmljZS4="
        }
        # (4 unchanged attributes hidden)

      ~ kubernetes_network_config {
          + service_ipv6_cidr = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0324aae8c89b56c79" -> (known after apply)
          - security_group_ids        = [] -> null
          ~ subnet_ids                = [ # forces replacement
              - "subnet-052fae2c369541923",
                # (2 unchanged elements hidden)
            ]
          ~ vpc_id                    = "vpc-080a377054fdb71a7" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_eks_node_group.node-group["eu-north-1a"] must be replaced
-/+ resource "aws_eks_node_group" "node-group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:eu-north-1:014630368052:nodegroup/dev-conquer-cluster/dev-conquer-node-group-0/80c5c790-6bed-fed0-bb31-ed78c8efd690" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "dev-conquer-cluster:dev-conquer-node-group-0" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          - "t3.micro",
          + "t3.small",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.28.2-20231027" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-conquer-node-group-0-80c5c790-6bed-fed0-bb31-ed78c8efd690"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      - tags                   = {} -> null
      ~ version                = "1.28" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 3 -> 2
          ~ max_size     = 3 -> 2
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_eks_node_group.node-group["eu-north-1b"] must be replaced
-/+ resource "aws_eks_node_group" "node-group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:eu-north-1:014630368052:nodegroup/dev-conquer-cluster/dev-conquer-node-group-1/a6c5c790-6bf3-4cbe-e371-c5bf5e9efb68" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "dev-conquer-cluster:dev-conquer-node-group-1" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          - "t3.micro",
          + "t3.small",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.28.2-20231027" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-conquer-node-group-1-a6c5c790-6bf3-4cbe-e371-c5bf5e9efb68"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      - tags                   = {} -> null
      ~ version                = "1.28" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 3 -> 2
          ~ max_size     = 3 -> 2
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_eks_node_group.node-group["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_eks_node_group" "node-group" {
      - ami_type        = "AL2_x86_64" -> null
      - arn             = "arn:aws:eks:eu-north-1:014630368052:nodegroup/dev-conquer-cluster/dev-conquer-node-group-2/d6c5c790-6bec-2954-d7c6-25161d249eeb" -> null
      - capacity_type   = "SPOT" -> null
      - cluster_name    = "dev-conquer-cluster" -> null
      - disk_size       = 20 -> null
      - id              = "dev-conquer-cluster:dev-conquer-node-group-2" -> null
      - instance_types  = [
          - "t3.micro",
        ] -> null
      - labels          = {} -> null
      - node_group_name = "dev-conquer-node-group-2" -> null
      - node_role_arn   = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role" -> null
      - release_version = "1.28.2-20231027" -> null
      - resources       = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-conquer-node-group-2-d6c5c790-6bec-2954-d7c6-25161d249eeb"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status          = "ACTIVE" -> null
      - subnet_ids      = [
          - "subnet-052fae2c369541923",
        ] -> null
      - tags            = {} -> null
      - tags_all        = {
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - version         = "1.28" -> null

      - scaling_config {
          - desired_size = 3 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # aws_iam_openid_connect_provider.eks-idp will be created
  + resource "aws_iam_openid_connect_provider" "eks-idp" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_role.AmazonEKS_EBS_CSI_DriverRole will be created
  + resource "aws_iam_role" "AmazonEKS_EBS_CSI_DriverRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AmazonEKS_EBS_CSI_DriverRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEBSCSIDriverPolicy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "AmazonEKS_EBS_CSI_DriverRole"
    }

  # aws_internet_gateway.igw will be destroyed
  # (because aws_internet_gateway.igw is not in configuration)
  - resource "aws_internet_gateway" "igw" {
      - arn      = "arn:aws:ec2:eu-north-1:014630368052:internet-gateway/igw-0cae512eb1e53a1b2" -> null
      - id       = "igw-0cae512eb1e53a1b2" -> null
      - owner_id = "014630368052" -> null
      - tags     = {
          - "Name" = "dev-conquer-vpc-igw"
        } -> null
      - tags_all = {
          - "Name"    = "dev-conquer-vpc-igw"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
    }

  # aws_nat_gateway.nat_gw["eu-north-1a"] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ association_id                     = "eipassoc-0254b44e4559fbde6" -> (known after apply)
      ~ id                                 = "nat-05ae3e10c3f2a7894" -> (known after apply)
      ~ network_interface_id               = "eni-0da9cfe6a9beffcdc" -> (known after apply)
      ~ private_ip                         = "10.0.4.4" -> (known after apply)
      ~ public_ip                          = "51.20.139.161" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0e5ff639c09637fec" # forces replacement -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1a"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_nat_gateway.nat_gw["eu-north-1b"] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ association_id                     = "eipassoc-0f0ffde2714e534f9" -> (known after apply)
      ~ id                                 = "nat-013894ebdf0f60275" -> (known after apply)
      ~ network_interface_id               = "eni-07f953919b8cc047b" -> (known after apply)
      ~ private_ip                         = "10.0.5.230" -> (known after apply)
      ~ public_ip                          = "16.171.246.247" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-02458b18d20e64552" # forces replacement -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1b"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_nat_gateway.nat_gw["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_nat_gateway" "nat_gw" {
      - allocation_id                      = "eipalloc-0fb5089af05d5575b" -> null
      - association_id                     = "eipassoc-05ac22c23992399f3" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-0ce1a1dc4d7ae04d9" -> null
      - network_interface_id               = "eni-0ccbe58b9415c5988" -> null
      - private_ip                         = "10.0.6.165" -> null
      - public_ip                          = "13.50.182.227" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-04be1cbf74a5d7b53" -> null
      - tags                               = {
          - "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1c"
        } -> null
      - tags_all                           = {
          - "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1c"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
    }

  # aws_route.nat_access["eu-north-1a"] will be updated in-place
  ~ resource "aws_route" "nat_access" {
        id                     = "r-rtb-02d414f0998dbc2fb1080289494"
      ~ nat_gateway_id         = "nat-05ae3e10c3f2a7894" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route.nat_access["eu-north-1b"] will be updated in-place
  ~ resource "aws_route" "nat_access" {
        id                     = "r-rtb-056165dcb82c1500f1080289494"
      ~ nat_gateway_id         = "nat-013894ebdf0f60275" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route.nat_access["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_route" "nat_access" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-09f228b985104d9e41080289494" -> null
      - nat_gateway_id         = "nat-0ce1a1dc4d7ae04d9" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-09f228b985104d9e4" -> null
      - state                  = "active" -> null
    }

  # aws_route_table.private_subnet_rt["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_route_table" "private_subnet_rt" {
      - arn              = "arn:aws:ec2:eu-north-1:014630368052:route-table/rtb-09f228b985104d9e4" -> null
      - id               = "rtb-09f228b985104d9e4" -> null
      - owner_id         = "014630368052" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0ce1a1dc4d7ae04d9"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "dev-conquer-nat-eu-north-1c-rt"
        } -> null
      - tags_all         = {
          - "Name"    = "dev-conquer-nat-eu-north-1c-rt"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc_id           = "vpc-080a377054fdb71a7" -> null
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_route_table_association" "private_subnet_rt_association" {
      - id             = "rtbassoc-05a3f22eafde2fa11" -> null
      - route_table_id = "rtb-09f228b985104d9e4" -> null
      - subnet_id      = "subnet-052fae2c369541923" -> null
    }

  # aws_subnet.eks_subnets_private["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_subnet" "eks_subnets_private" {
      - arn                                            = "arn:aws:ec2:eu-north-1:014630368052:subnet/subnet-052fae2c369541923" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-north-1c" -> null
      - availability_zone_id                           = "eun1-az3" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-052fae2c369541923" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "014630368052" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "dev-conquer-private_subnet_eu-north-1c"
          - "Tier" = "Private"
        } -> null
      - tags_all                                       = {
          - "Name"    = "dev-conquer-private_subnet_eu-north-1c"
          - "Tier"    = "Private"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc_id                                         = "vpc-080a377054fdb71a7" -> null
    }

  # aws_subnet.eks_subnets_public["eu-north-1a"] must be replaced
-/+ resource "aws_subnet" "eks_subnets_public" {
      ~ arn                                            = "arn:aws:ec2:eu-north-1:014630368052:subnet/subnet-0e5ff639c09637fec" -> (known after apply)
      ~ availability_zone_id                           = "eun1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.4.0/24" -> "10.0.3.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0e5ff639c09637fec" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "014630368052" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "dev-conquer-public_subnet_eu-north-1a"
            "Tier" = "Public"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.eks_subnets_public["eu-north-1b"] must be replaced
-/+ resource "aws_subnet" "eks_subnets_public" {
      ~ arn                                            = "arn:aws:ec2:eu-north-1:014630368052:subnet/subnet-02458b18d20e64552" -> (known after apply)
      ~ availability_zone_id                           = "eun1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.5.0/24" -> "10.0.4.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-02458b18d20e64552" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "014630368052" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "dev-conquer-public_subnet_eu-north-1b"
            "Tier" = "Public"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.eks_subnets_public["eu-north-1c"] will be destroyed
  # (because key ["eu-north-1c"] is not in for_each map)
  - resource "aws_subnet" "eks_subnets_public" {
      - arn                                            = "arn:aws:ec2:eu-north-1:014630368052:subnet/subnet-04be1cbf74a5d7b53" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-north-1c" -> null
      - availability_zone_id                           = "eun1-az3" -> null
      - cidr_block                                     = "10.0.6.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04be1cbf74a5d7b53" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "014630368052" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "dev-conquer-public_subnet_eu-north-1c"
          - "Tier" = "Public"
        } -> null
      - tags_all                                       = {
          - "Name"    = "dev-conquer-public_subnet_eu-north-1c"
          - "Tier"    = "Public"
          - "owners"  = "the-devops-guys"
          - "project" = "dev-conquer"
        } -> null
      - vpc_id                                         = "vpc-080a377054fdb71a7" -> null
    }

Plan: 11 to add, 2 to change, 16 to destroy.

Changes to Outputs:
  ~ endpoint                              = "https://4D5C911EA4AAC0B003DA9BED7AED4EA6.gr7.eu-north-1.eks.amazonaws.com" -> (known after apply)
  ~ kubeconfig-certificate-authority-data = (sensitive value)
  ~ oidc-issuer                           = [
      - {
          - oidc = [
              - {
                  - issuer = "https://oidc.eks.eu-north-1.amazonaws.com/id/4D5C911EA4AAC0B003DA9BED7AED4EA6"
                },
            ]
        },
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @carlosgit2016, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*